### I hope you have learned about pandas in a quite good manner , now its time to move on to a test for it. Here you are provided with some questions of which you need to write the code and test your understanding of the concept.

In [1]:
import pandas as pd
import numpy as np

### Q1.

```
import numpy as np
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))
```
**Write code to convert the above mydict variable into dataframe , your code should return a dataframe like below.**

```
a    0
b    1
c    2
d    4
```

In [2]:
import numpy as np
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))

In [3]:
list_df = pd.DataFrame(mylist)
arr_df = pd.DataFrame(myarr)
dict_df = pd.concat((list_df,arr_df), axis=1)
dict_df.columns = ['Characters', 'Numbers']
dict_df.head()

  Characters  Numbers
0          a        0
1          b        1
2          c        2
3          e        3
4          d        4

### Q2. Write the code to get frequency count of each character from the result of below command
```
ser = pd.Series(np.take(list('abcdefgh'), np.random.randint(8, size=30)))
```

In [4]:
## your output should look like this.

In [5]:
ser = pd.Series(np.take(list('abcdefgh'), np.random.randint(8, size=30)))
ser.duplicated().sum()

23

In [6]:
ser.value_counts()

b    7
h    5
d    4
f    4
g    4
a    3
c    3
Name: count, dtype: int64

### Q3. What parameter to do we need to add in read_csv, which let us read only a bunch of columns from the whole dataset.

In [7]:
# just write that parameter name here 
# file name

<p style="color:brown;">For Next 3 question you need to work on fruits sample dataset provided in resources.</p>

In [8]:
# read fruits.csv file
fruit_df = pd.read_csv('fruits.csv',)

### Q4. Get mean, median, max , min price for each fruit .

In [9]:
# Your output should look like this

In [10]:
fruit = pd.read_csv('fruits.csv')
fruit_df = pd.DataFrame(fruit)
fruit_df

   Fruit Name  Quantity  Price
0      Banana        78    112
1       Mango        40    160
2      Banana        20     85
3   PineApple        15     90
4  Strawberry       100    200
5       Mango        25     60
6       Mango        40    100
7   PineApple        50    285

In [11]:
result = fruit_df.groupby('Fruit Name')['Price'].aggregate(['mean','median','max','min'])
result
# result.mean()

                  mean  median  max  min
Fruit Name
Banana       98.500000    98.5  112   85
Mango       106.666667   100.0  160   60
PineApple   187.500000   187.5  285   90
Strawberry  200.000000   200.0  200  200

### Q5. What is the total cost of this basket?

In [12]:
#your output should be this

In [13]:
fruit_df['Price'].sum()

1092

### Q6. Which fruit has the maximum price per quantity?

In [14]:
# your output should be

In [15]:
mask = fruit_df['Price'] >= fruit_df['Price'].max()
mask

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7     True
Name: Price, dtype: bool

In [16]:
F_name = fruit_df[mask]['Fruit Name'].iloc[0]
print(F_name)

PineApple

### Q7. Given an array 
```arr = [ 0,1,0,1,0,2,3,6,5,0,0,0,4,1,2,3,5,5,4,4 ]```
<br>
**Write code to  Create one_hot encoded dataframe of this array.**

In [17]:
#your output should be like this and should have 20 records in total

In [18]:
arr = [ 0,1,0,1,0,2,3,6,5,0,0,0,4,1,2,3,5,5,4,4 ]
arr_ = np.array(arr)
new_arr = arr_.reshape(5,4)
new_arr

array([[0, 1, 0, 1],
       [0, 2, 3, 6],
       [5, 0, 0, 0],
       [4, 1, 2, 3],
       [5, 5, 4, 4]])

In [19]:
new_arr_df = pd.DataFrame(new_arr)
new_arr_df

   0  1  2  3
0  0  1  0  1
1  0  2  3  6
2  5  0  0  0
3  4  1  2  3
4  5  5  4  4

### Q8. 
```
dict_ = {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score':[np.nan, 40, 80, 98]

```
#### a. Convert this above dict to pandas dataframe

In [20]:
#your output should be like this

In [21]:
dict_ = {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score':[np.nan, 40, 80, 98]}

In [22]:
df = pd.DataFrame(dict_)
df

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         95.0           NaN         98.0

#### b. Write code to get the number of missing values for each column.

In [23]:
#your output should be like this

In [24]:
df.isna().sum()

First Score     1
Second Score    1
Third Score     1
dtype: int64

#### c. Fill this nan values with mean value of their respective column

In [25]:
#your output should be like this

In [26]:
df['First Score'] = df['First Score'].fillna(value= df['First Score'].mean())

In [27]:
df['Second Score'] = df['Second Score'].fillna(value=round(df['Second Score'].mean(),6))

In [28]:
df['Third Score'] = df['Third Score'].fillna(value=round(df['Third Score'].mean(),6))

In [29]:
df

   First Score  Second Score  Third Score
0        100.0     30.000000    72.666667
1         90.0     45.000000    40.000000
2         95.0     56.000000    80.000000
3         95.0     43.666667    98.000000

### Q9. Add an index column to the table used in Q4.
*HINT : Rest index*

In [30]:
#your output should be like this

In [31]:
fruit_df

   Fruit Name  Quantity  Price
0      Banana        78    112
1       Mango        40    160
2      Banana        20     85
3   PineApple        15     90
4  Strawberry       100    200
5       Mango        25     60
6       Mango        40    100
7   PineApple        50    285

In [32]:
fruit_df.reset_index(inplace=True)
fruit_df

   index  Fruit Name  Quantity  Price
0      0      Banana        78    112
1      1       Mango        40    160
2      2      Banana        20     85
3      3   PineApple        15     90
4      4  Strawberry       100    200
5      5       Mango        25     60
6      6       Mango        40    100
7      7   PineApple        50    285

### Q10. 
**You are provided wih two different csv files ,**
```
sample_sheet_1.csv
sample_sheet_2.csv 
```
<p>
    
**You just need to read both of them , and merge them based on location column.**

In [33]:
#your output should be like this

In [39]:
sheet_1 = pd.read_csv('sample_sheet_1.csv')
sheet_2 = pd.read_csv('sample_sheet_2.csv')

In [40]:
sheet_1

  Location Population  House_count Location Area
0      ABB   2.5 lakh          763    25 hectare
1      ABC   1.5 lakh          520    20 hectare
2      CDD   3.5 lakh          800    35 hectare

In [41]:
sheet_2

  Location  No. of shops Weekly market day
0      ABB           150   Nothing as such
1      ABC           120           Tuesday
2      CDD           180         Wednesday

In [42]:
sheet_1.merge(sheet_2, how='inner')

,Location,Population,House_count,Location Area,No. of shops,Weekly market day
0,ABB,2.5 lakh,763,25 hectare,150,Nothing as such
1,ABC,1.5 lakh,520,20 hectare,120,Tuesday
2,CDD,3.5 lakh,800,35 hectare,180,Wednesday